_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменESTML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_ОбменESTML</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьСохранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтборСмет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛокальнаяСмета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_Файлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменESTML/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ВыгрузитьНаСервер(АдресФайлаВоВременномХранилище)
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ОбъектДляСервера = РеквизитФормыВЗначение("Объект");
	ОбъектДляСервера.ВыгрузитьНаСервере(Объект.ПутьСохранения,Объект.ОтборСмет.Выгрузить().ВыгрузитьКолонку("ЛокальнаяСмета"),АдресФайлаВоВременномХранилище,ИмяВременногоФайла);
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСерверВеб(Адрес)
	ОбъектДляСервера = РеквизитФормыВЗначение("Объект");
	ОбъектДляСервера.ВыгрузитьНаСервере(Адрес,Объект.ОтборСмет.Выгрузить().ВыгрузитьКолонку("ЛокальнаяСмета"),,,Истина);
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	#Если Не ВебКлиент Тогда
		Если Не ЗначениеЗаполнено(Объект.ПутьСохранения) Тогда
			ПоказатьПредупреждение(,НСтр("ru='Не выбран каталог!'"));
			Возврат;
		КонецЕсли;
     	АдресФайлаВоВременномХранилище = "";
		ВыгрузитьНаСервер(АдресФайлаВоВременномХранилище);
		
		Для Каждого ключ Из АдресФайлаВоВременномХранилище Цикл
			ПолучитьФайл(ключ.Значение,Объект.ПутьСохранения+ключ.Ключ,Ложь);
		КонецЦикла;

	#КонецЕсли

	#Если ВебКлиент Тогда
		Оповещение = Новый ОписаниеОповещения("ПродолжитьНачатьПодключениеРасширенияРаботыСФайлами", ЭтаФорма);
		НачатьПодключениеРасширенияРаботыСФайлами(Оповещение) ;
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьНачатьПодключениеРасширенияРаботыСФайлами(Подключено,ДополнительныеПараметры) Экспорт
	Если Не Подключено Тогда
		Оповещение = Новый ОписаниеОповещения("ПродолжитьНачатьУстановкуРасширения", ЭтаФорма);
		НачатьУстановкуРасширенияРаботыСФайлами(Оповещение);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПродолжитьВыгрузкуВеб", ЭтаФорма);
		НачатьПолучениеКаталогаДокументов(Оповещение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьНачатьУстановкуРасширения(ДополнительныеПараметры) Экспорт
	Оповещение = Новый ОписаниеОповещения("ПродолжитьВыгрузкуВеб", ЭтаФорма);
	НачатьПолучениеКаталогаДокументов(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыгрузкуВеб(ИмяКаталогаДокументов,ДополнительныеПараметры) Экспорт
	ВыгрузитьНаСерверВеб(ИмяКаталогаДокументов);
КонецПроцедуры

&НаКлиенте
Процедура ПутьСохраненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 				= Ложь;
	Режим 								= РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла 				= Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла 	= "";
	ДиалогОткрытияФайла.Заголовок 		= НСтр("ru='Выберите каталог'");
	
	// Синхронный вызов
	//Если ДиалогОткрытияФайла.Выбрать() Тогда
	//	Объект.ПутьСохранения = ДиалогОткрытияФайла.Каталог;
	//КонецЕсли;
	
	// Замена на асинхронный вызов
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораКаталога", ЭтотОбъект);
	ДиалогОткрытияФайла.Показать(ОповещениеВыбора);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораКаталога(ВыбранныеФайлы,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ТекЭлемент Из ВыбранныеФайлы Цикл
			Объект.ПутьСохранения = ТекЭлемент;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 					= Ложь;
	Режим 									= РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла 					= Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла 		= "";
	Фильтр 									= "Смета(*.estml)|*.estml|Смета(*.xml)|*.xml";
	ДиалогОткрытияФайла.Фильтр 				= Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор 	= Ложь;
	ДиалогОткрытияФайла.Заголовок 			= НСтр("ru='Выберите файл'");
	
	// Синхронный вызов
	//Если ДиалогОткрытияФайла.Выбрать() Тогда
	//	Объект.ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
	//КонецЕсли;

	// Замена на асинхронный вызов
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайла", ЭтотОбъект);
	ДиалогОткрытияФайла.Показать(ОповещениеВыбора);	

	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайла(ВыбранныеФайлы,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ТекЭлемент Из ВыбранныеФайлы Цикл
			Объект.ПутьКФайлу = ТекЭлемент;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	#Если Не ВебКлиент Тогда
		Если Не ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
			ПоказатьПредупреждение(,НСтр("ru='Не выбран файл для загрузки!'"));
			Возврат;
		КонецЕсли;
		ДвоичныеДанные 				= Новый ДвоичныеДанные(Объект.ПутьКФайлу);
		АдресВременногоХранилища 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		ЗагрузитьНаСервер(АдресВременногоХранилища);
		Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
			Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Обработка.СМ_ДеревоСмет.Форма.ФормаУпр" Тогда
				ЭтаФорма.ВладелецФормы.Элементы.СписокОбъектыСтроительства.обновить()
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
	#Если ВебКлиент Тогда
		// Синхронный вызов
		//Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
		//	АдресВременногоХранилищаФайла = "";
		//	ИмяФайла = "";
		//	Оповещение = Новый ОписаниеОповещения("ПродолжитьЗагрузкуВеб", ЭтаФорма);
		//	НачатьПомещениеФайла(Оповещение,АдресВременногоХранилищаФайла,ИмяФайла,Истина,ЭтаФорма.УникальныйИдентификатор); 
		//КонецЕсли;
		
		// Замена на асинхронный вызов
		ОповещениеПодключения = Новый ОписаниеОповещения("ВыполнитьПослеПодключенияРасширения", ЭтотОбъект);
		НачатьПодключениеРасширенияРаботыСФайлами(ОповещениеПодключения); 
		
	#КонецЕсли
	
	Оповестить("ОбновитьДеревоСмет");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПодключенияРасширения(Подключено,ДополнительныеПараметры) Экспорт
	
	Если НЕ Подключено Тогда
		АдресВременногоХранилищаФайла 	= "";
		ИмяФайла 						= "";
		Оповещение 						= Новый ОписаниеОповещения("ПродолжитьЗагрузкуВеб", ЭтаФорма);
		НачатьПомещениеФайла(Оповещение,АдресВременногоХранилищаФайла,ИмяФайла,Истина,ЭтаФорма.УникальныйИдентификатор); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗагрузкуВеб(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	ЗагрузитьНаСерверВеб(Адрес);
	Если ЭтаФорма.ВладелецФормы<>Неопределено Тогда
		Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Обработка.СМ_ДеревоСмет.Форма.ФормаУпр" Тогда
			ЭтаФорма.ВладелецФормы.Элементы.СписокОбъектыСтроительства.обновить()
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервер(АдресВременногоХранилища)
	Запись = РегистрыСведений.СМ_Файлы.СоздатьМенеджерЗаписи();
	Запись.ИмяФайла = Объект.ПутьКФайлу;
	Запись.Файл = Новый ХранилищеЗначения(ПолучитьИЗВременногоХранилища(АдресВременногоХранилища));
	Запись.Записать();

	ОбъектДляСервера = РеквизитФормыВЗначение("Объект");
	ОбъектДляСервера.ПрочитатьНаСервере(Объект.ПутьКФайлу);
	
	Запись = РегистрыСведений.СМ_Файлы.Выбрать(Новый Структура("ИмяФайла",Объект.ПутьКФайлу)); 
	Запись.Следующий();
	Запись.ПолучитьМенеджерЗаписи().Удалить();

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСерверВеб(Адрес)
	ОбъектДляСервера = РеквизитФормыВЗначение("Объект");
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	ДвоичныеДанные.Записать(ИмяФайла);
	Адрес = ИмяФайла;
	ОбъектДляСервера.ПрочитатьНаСервере(Адрес);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Ключ") Тогда
		Если Параметры.Ключ = "ДеревоСметВыгрузка" Тогда
			Для каждого эл Из Параметры.СписокВыгрузки Цикл
				СтрСмета = Объект.ОтборСмет.Добавить();
				СтрСмета.ЛокальнаяСмета = эл.Значение;
			КонецЦикла;
			Элементы.Группа4.Видимость = Ложь;
		ИначеЕсли Параметры.Ключ = "ДеревоСметЗагрузка" Тогда 
			Объект.ПутьКФайлу = Параметры.ПутьКФайлу;
			Элементы.Группа3.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если ВебКлиент Тогда
		Элементы.ПутьКФайлу.Видимость = Ложь;
		Элементы.ПутьСохранения.Видимость = Ложь;
	#КонецЕсли
	
	Если ЗначениеЗаполнено(Параметры.ИмяФайла) Тогда
		Объект.ПутьКФайлу = Параметры.ИмяФайла;
		#Если Не ВебКлиент Тогда
			ДвоичныеДанные = Новый ДвоичныеДанные(Объект.ПутьКФайлу);
			АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
			ЗагрузитьНаСервер(АдресВременногоХранилища);
		#КонецЕсли
		#Если ВебКлиент Тогда
			АдресВременногоХранилищаФайла = "";
			Оповещение = Новый ОписаниеОповещения("ПродолжитьЗагрузкуВеб", ЭтаФорма);
			НачатьПомещениеФайла(Оповещение,АдресВременногоХранилищаФайла,Параметры.ИмяФайла,Ложь,ЭтаФорма.УникальныйИдентификатор); 
		#КонецЕсли
		Оповестить("ОбновитьДеревоСмет");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборСметЛокальнаяСметаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОписаниеОЗакрытииФормыВыбораЛС = Новый ОписаниеОповещения("ПриЗакрытииФормыПодбораЛС",ЭтаФорма);
	ОткрытьФорму("Обработка.СМ_ДеревоСметПростое.Форма.ФормаУпр",,ЭтаФорма,,,,ОписаниеОЗакрытииФормыВыбораЛС,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыПодбораЛС(ТекЛС,ТекПараметр) Экспорт
	Если ТекЛС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.ОтборСмет.ТекущиеДанные.ЛокальнаяСмета = ТекЛС;
КонецПроцедуры

#КонецОбласти
